package ru.stimmax.cotlincouse.lessons.lesson04.homework
val v1: Byte = 42
val v2: Long = 98765432123456789L
val v3: Float = 23.45f
val v4: Double = 0.123456789
val v5: String = "Kotlin & Java"
// false - должно быть в нижнем регистре
//val v6: Boolean = FALSE
val v7: Char = 'c'
val v8: Int = 500
val v9: Long = 4294967296L
val v10: Float = 18.0f
val v11: Double  = -0.001
val v12: String = "OpenAI"
val v13: String = "true"
val v14: List<Int> = listOf(3, 14)
val v15: Char = '9'
val v16: Int = 2048
val v17: Long = 10000000000L
val v18: Set<String> = setOf("OpenAI", "Quantum Computing")
val v19: Float = 5.75f
// Не должно быть ковычек, тип Double
//val v20 = `1.414`
val v21: String = "Artificial Intelligence"
val v22: Array<Any> = arrayOf('x', "A")
val v23: String = "Android Studio"
val v24: Char = '@'
val v25: Short = 1024
val v26: Long = 1234567890123L
val v27: Float = 10.01f
val v28: Double = -273.15
val v29: String = "SpaceX"
// false - должно быть в нижнем регистре
//val v30: Boolean = FALSE
val v31: Double = 0.007
// Неправильные кавычки
//val v32: String = “🤯”
val v33: Map<String, Int> = mapOf("true" to 2, "false" to 34)
// если хотим стоку то надо поставить "". Если хотим число то кавычки надо убрать
//val v34 = ‘65535’
val v35: Long = 72057594037927935L
val v36: Float = 2.71828f
val v37: Double = 101.0101
val v38: String = "Quantum Computing"
val v39: Map<Int, String> = mapOf(2 to "true", 34 to "false")
val v40: Char = 'x'
val v41: Short = 314
val v42: Long = 123456789123456789L
val v43: Float = 6.626f
// true должно быть в нижнем регистре
//val v44: Boolean = TRUE

//Хранить букву, на которую указывает палец медиума во время спиритического сеанса.
val v44: Char = 'A'

//Хранить количество ложек сахара, которые я кладу в одну чашку чая.
val v45: Byte = 3

//Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле.
val v46: String = "Хранить список расходов на доставку еды"
// Хранить длину очереди в столовой до миллиардной доли сантиметра.
val v47: Long = 100000L

//Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу.
val v48: Boolean = true
// Хранить количество свистков чайника за день.
val v49: Byte = 10

//Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы.
val v50: Byte = 100

//Хранить количество попыток пересчитать звёзды на небе за всю историю человечества.
val v51: Long = 1_000_000_000L

// Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма.
val v52: Double = 100.35

//Хранить словарь «название стартапа → сумму потерь инвесторов».
val v53: Map<String, Int> = mapOf("Название" to 100000)

// Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов.
val v54: String =  "починилось само"

val v55: String = "список тем для митингов"




